import React from "react";
import {
  Container,
  Title,
  Line,
  SubTitle,
  SubContainer,
  ContentBox,
  Detail,
} from "../../css/setting/TermsofUseCss";

export const TermsofUse = () => {
  return (
    <>
      <Container>
        <SubContainer>
          <Title>홈페이지 이용약관</Title>
          <Line />
        </SubContainer>
        <ContentBox>
          <SubTitle>사이트 이용 약관 동의</SubTitle>
          <Detail>
            본 약관은 (주)HOPE 서비스 이용과 관련하여 필요한 사항을 규정합니다.
          </Detail>
          <Detail>
            1. 주식회사 HOPE 컴퍼니(이하 '회사'라고 합니다)에서 운영하는
            홈페이지 (https://www.hope.co.kr/, 이하 “홈페이지”라고 합니다)는
            아래와 같은 약관에 동의하는 이용자들에게 제공되는 인터넷서비스로, 본
            약관은 이용자와 회사 사이에 본 홈페이지 이용에 관한 권리 및 의무를
            규정하는 것을 목적으로 합니다.
          </Detail>
          <Detail>
            2. 본 홈페이지에 포함된 자료는 이용자에게 정보 제공을 위한
            목적으로만 제공됩니다. 이용자는 본 홈페이지의 내용에 대하여 어떤
            방법으로도 배포, 출판, 전송, 변경, 전시, 모방작품의 창조 혹은 개발할
            수 없습니다. 이용자는 회사의 권한을 보호하여야 하고, 본 홈페이지의
            자료를 허가 없이 유용할 수 없습니다. 허가 없이 본 홈페이지의 내용을
            유용하는 경우에 회사는 이용자에게 법적, 재정적으로 가능한 기타
            추가적인 배상을 청구할 수 있습니다.
          </Detail>
          <Detail>
            3. 이용자가 제출하는 자료의 내용에 대한 책임은 전적으로 이용자에게
            있습니다. 이용자가 제출하는 자료에 불법, 중상모략, 비난 혹은
            비도덕적인 내용이 포함되어서는 안됩니다. 이용자는 본 홈페이지에
            저작권, 등록상표권, 사생활권 혹은 기타 사적 권리 혹은 소유권을
            포함하는 제3자의 권리를 침해하는 어떤 자료도 게시하여서는 안됩니다.
          </Detail>
          <Detail>
            4. 이용자가 제출하는 자료의 내용에 대한 책임은 전적으로 이용자에게
            있습니다. 이용자가 제출하는 자료에 불법, 중상모략, 비난 혹은
            비도덕적인 내용이 포함되어서는 안됩니다. 이용자는 본 홈페이지에
            저작권, 등록상표권, 사생활권 혹은 기타 사적 권리 혹은 소유권을
            포함하는 제3자의 권리를 침해하는 어떤 자료도 게시하여서는 안됩니다.
          </Detail>
          <SubTitle>용어의 정의</SubTitle>
          <Detail>본 약관에서 사용하는 용어는 다음과 같이 정의합니다.</Detail>
          <Detail>
            1. “이용자”란 홈페이지에 접속하여 홈페이지를 이용하는 회원 및
            비회원을 말합니다.
          </Detail>
          <Detail>
            2. '회원”이란 홈페이지에 접속하여 본 약관에 따라 회사 인터넷
            회원으로 가입하여 홈페이지가 제공하는 서비스를 받는 자를 말하고,
            “비회원”이란 회원이 아닌 자를 말합니다.
          </Detail>
          <SubTitle>약관의 효력 및 개정 등</SubTitle>
          <Detail>
            1. 본 약관은 그 내용을 회사가 홈페이지에 게시하고, 회원이 홈페이지
            회원가입 시 본 약관에 동의함으로써 그 효력이 발생합니다.
          </Detail>
          <Detail>
            2. 회사는 본 약관을 변경할 수 있으며 약관을 개정할 경우에는 적용일자
            및 개정사유를 명시하여 홈페이지에 그 적용일의 7일전부터 공시하거나
            회원이 입력한 가장 최근의 이메일로 전송하는 방법으로 회원에게
            고지합니다. 다만, 회원에게 불리한 내용으로 약관을 개정하는 경우에는
            적용일로부터 30일 전까지 홈페이지에 공시하고 회원이 입력한 가장
            최근의 이메일로 전송하는 방법으로 회원에게 고지합니다.
          </Detail>
          <Detail>
            3. 변경된 약관은 공시하거나 고지한 적용일로부터 효력이 발생합니다.
          </Detail>
          <Detail>
            4. 회원이 변경된 약관 사항에 동의하지 않을 경우, 약관의 효력 발생
            전일까지 서비스 이용을 중단하거나 회원 탈퇴를 할 수 있으며, 약관의
            개정과 관련하여 효력 발생일 전일까지 이의를 제기하지 않는 경우에는
            개정된 약관에 동의한 것으로 간주합니다.
          </Detail>
          <SubTitle>회원 관리 및 서비스</SubTitle>
          <Detail>
            1. 회원 가입은 무료입니다. 다만, 14세 미만인 자는 회원으로 가입할 수
            없습니다.
          </Detail>
          <Detail>
            2. 회원ID(계정)는 1인당 1개의 ID만 생성 및 등록이 가능하며, ID생성을
            위해 필요한 개인정보를 허위로 제공하거나, 본인이 아닌 타인의 정보를
            무단으로 사용하여 회원ID를 만들 수 없습니다. 이를 위반할 경우,
            회원에게 제공되는 서비스의 제한이 있을 수 있으며, 본 약관 각
            조항에서 정하고 있는 불이익을 받을 수 있습니다.
          </Detail>
          <Detail>
            3. 회원 자신의 ID가 부정하게 사용된 경우 해당 회원은 반드시 회사에
            그 사실을 지체 없이 통보하여 조치를 받아야 하며, 통보의 지연으로
            인해 발생하는 손해는 회사가 책임지지 않습니다.
          </Detail>
          <Detail>
            4. 회원정보 - 회원은 가입 시 기재하는 모든 정보를 사실에 기초한
            정보로 기재하여야 합니다. 실제 정보를 입력하지 않은 회원은 법적인
            보호를 받을 수 없으며 회사로부터 서비스 이용 제한 등의 조치를 받을
            수 있습니다.
          </Detail>
          <SubTitle>서비스에 포함된 회원 게시물 및 커뮤니티 관리</SubTitle>
          <Detail>
            1. 회원이 홈페이지를 이용하여 홈페이지에 게시한
            부호ㆍ문자ㆍ음성ㆍ음향ㆍ화상ㆍ동영상 등의 정보 형태의 글, 사진,
            동영상 및 각종 파일과 링크 등 '게시물'의 저작권은 적법한
            저작권자에게 귀속됩니다.
          </Detail>
          <Detail>
            2. 회원이 홈페이지를 이용하는 경우, 회사는 회원의 프로필 사진 및
            게시물(예: 캘린더 상 직접 입력 정보, 리뷰, 댓글 등)을 회원 서비스
            화면에 표시할 수 있습니다. 이 경우, 회사는 저작권법 규정을 준수하며,
            회원은 언제든지 고객센터 또는 홈페이지 내 관리기능을 통해 해당
            게시물에 대해 삭제, 비공개 등의 조치를 취할 수 있습니다.
          </Detail>
          <Detail>
            3. 회사는 회원의 게시물과 커뮤니티를 소중하게 생각하며 게시물 및
            채팅 내용들이 변조, 훼손, 삭제되지 않도록 최선을 다하여 보호합니다.
            그러나 회원의 게시물이 '정보통신망법' 및 '저작권법' 등 관련법에
            위반되는 내용을 포함하는 경우, 권리자는 관련법이 정한 절차에 따라
            해당 게시물 및 채팅 내용의 게시 중단 및 삭제 등을 요청할 수 있으며,
            회사는 관련법에 따라 조치를 취하여야 합니다.
          </Detail>
          <Detail>
            4. 회사는 전항에 따른 권리자의 요청이 없는 경우라도 권리 침해가
            인정될 만한 사유가 있거나 기타 회사 정책 및 관련법에 위반되는
            경우에는 관련법에 따라 해당 '게시물 및 채팅 내용'에 대해 임시 조치
            등을 취할 수 있습니다.
          </Detail>
          <Detail>
            5. 회사는 바람직한 게시판 및 커뮤니티 문화를 활성화하기 위하여 동의
            없는 타인의 신상 공개 시 특정부분을 삭제하거나 기호 등으로 수정하여
            게시할 수 있습니다.
          </Detail>
          <Detail>
            6. 게시물 및 커뮤니티에 관련된 제반 권리와 책임은 작성자 개인에게
            있습니다. 또 게시물 및 커뮤니티를 통해 자발적으로 공개된 정보는
            보호받기 어려우므로 정보 공개 전에 심사숙고 하시기 바랍니다.
          </Detail>
          <SubTitle>회원 탈퇴</SubTitle>
          <Detail>
            1. 회원은 탈퇴를 희망하는 경우, 마이페이지에서 “회원 탈퇴” 버튼을
            사용하여 탈퇴 신청을 합니다.
          </Detail>
          <Detail>
            2. 회원이 다음 각 호의 사유에 해당하는 경우, 회사는 회원자격을 제한
            또는 정지시킬 수 있고, 14일의 기간을 정하여 시정하거나 소명할 기회를
            부여한 뒤, 회원의 소명이 없거나 그 소명이 정당하지 아니한 경우
            회원자격을 박탈할 수 있습니다. <br />
            <br />
            가. 타인의 회사 이용을 방해하거나 그 정보를 도용하는 등
            전자거래질서를 위협하는 경우 <br />
            나. 회원 가입 시 허위 내용의 등록 및 타인의 정보 도용 <br />
            다. 관계 법령을 위배하거나 미풍양속을 저해하고자 하는 목적으로 회원
            가입신청을 할 경우 <br />
            라. 회사 서비스 이용과 관련하여 법령, 본 약관 또는 공서양속에 반하는
            행위를 하는 경우 <br />
            마. 회사 또는 기타 제3자의 권리를 침해하거나 도용하였을 경우 <br />
            바. 회사 또는 기타 제3자에 대해 명예 또는 신용 훼손, 폭언, 폭행,
            성적 언행 등 부적절한 행위를 하거나 업무를 방해하는 행위
          </Detail>
          <SubTitle>서비스의 중단</SubTitle>
          <Detail>
            1. 회사는 컴퓨터 등 정보통신설비의 보수 점검 교체 및 고장, 통신의
            두절, 기타 불가항력적 사유가 발생한 경우에는 서비스의 제공을
            일시적으로 중단할 수 있습니다.
          </Detail>
          <Detail>
            2. 회사는 제1항의 사유로 서비스의 제공이 일시적으로 중단됨으로
            인하여 이용자 또는 제3자가 입은 손해에 대하여 배상하지 아니합니다.
            단 회사의 고의 또는 과실이 있는 경우에는 그러하지 아니합니다.
          </Detail>
        </ContentBox>
      </Container>
    </>
  );
};
